[
  {
    "id": "clnga4d0l0000mxloj5msbp01",
    "name": "Pumpkin Turkey Chili",
    "image": "https://www.allrecipes.com/thmb/g5TdtWI8HaKBP_pGjWPV4Oll2D4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/270553-pumpkin-turkey-chili-Darcey55-1x1-1-206dbb134bcf4e7e8f903144d7a9497f.jpg",
    "description": "This turkey pumpkin chili is absolutely delicious. It's quick and easy, too!",
    "servings": 6,
    "prepTime": 10,
    "cookTime": 20,
    "ingredients": "1 tablespoon vegetable oil\n\n        1 cup chopped onion\n        \n        ½ cup chopped green bell pepper\n        \n        ½ cup chopped yellow bell pepper\n        \n        1 clove garlic, minced\n        \n        1 pound ground turkey\n        \n        1 (14.5 ounce) can diced tomatoes\n        \n        2 cups pumpkin puree\n        \n        1 ½ tablespoons chili powder or more to taste\n        \n        ½ teaspoon ground black pepper\n        \n        1 dash salt\n        \n        ½ cup shredded Cheddar cheese\n        \n        ½ cup sour cream",
    "directions": "Heat oil in a large skillet over medium heat. Add onion, green bell pepper, yellow bell pepper, and garlic; cook and stir until tender.\n\n        Stir in turkey and cook until evenly brown; drain.\n        \n        Mix in tomatoes and pumpkin. Season with chili powder, pepper, and salt. Reduce heat to low, cover, and simmer 15 to 20 minutes. Serve topped with Cheddar cheese and sour cream."
  },
  {
    "id": "clngbeulv0000mxhd1o5dli54",
    "name": "Baked Ziti",
    "image": "https://www.allrecipes.com/thmb/VUjF0WqLJFUQKCnOItM7mMlk-LE=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/4557541-21604073f2774e89b532193821d6cd9c.jpg",
    "description": "This baked ziti is always a hit! A lady I worked with brought this in one day, and everyone loved it. Now it is the favorite of all my dinner guests. I have made this also without the meat, and it is well received.",
    "servings": 10,
    "prepTime": 15,
    "cookTime": 45,
    "ingredients": "1 pound dry ziti pasta\n\n      1 onion, chopped\n      \n      1 pound lean ground beef\n      \n      2 (26 ounce) jars spaghetti sauce\n      \n      6 ounces provolone cheese, sliced\n      \n      1 ½ cups sour cream\n      \n      6 ounces mozzarella cheese, shredded\n      \n      2 tablespoons grated Parmesan cheese",
    "directions": "Bring a large pot of lightly salted water to a boil. Add ziti pasta, and cook until al dente, about 8 minutes; drain.\n\n      Meanwhile, brown ground beef and onion in a large skillet over medium heat; stir in spaghetti sauce and simmer for 15 minutes.\n      \n      Preheat the oven to 350 degrees F (175 degrees C). Butter a 9x13-inch baking dish.\n      \n      Spread 1/2 of the ziti in the bottom of the prepared dish; top with Provolone cheese, sour cream, 1/2 of the meat sauce, remaining ziti, mozzarella cheese, and remaining meat sauce. Top with grated Parmesan cheese.\n      \n      Bake in the preheated oven until heated through and cheeses have melted, about 30 minutes."
  },
  {
    "id": "clngbjaxg0001mxhdf5ledb6v",
    "name": "Butternut Squash Soup",
    "image": "https://www.allrecipes.com/thmb/6MWFchT-TFPy6cnxWRX22XZq0yU=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/77981-butternut-squash-soup-ii-DDMFS-4x3-90a6bf5fa88346699bf41d502a029798.jpg",
    "description": "This is a thick, rich butternut squash soup with tons of flavor. Something I whipped up off the top of my head, with things I had on hand. Super easy, quick, and a great way to use squash. An instant hit at my house.",
    "servings": 4,
    "prepTime": 20,
    "cookTime": 45,
    "ingredients": "2 tablespoons butter\n\n      1 small onion, chopped\n      \n      1 stalk celery, chopped\n      \n      1 medium carrot, chopped\n      \n      2 medium potatoes, cubed\n      \n      1 medium butternut squash - peeled, seeded, and cubed\n      \n      1 (32 fluid ounce) container chicken stock\n      \n      salt and freshly ground black pepper to taste",
    "directions": "Gather all ingredients.\n\n      Melt butter in a large pot over medium heat, and cook onion, celery, carrot, potatoes, and squash until lightly browned, about 5 minutes. Pour in enough chicken stock to cover vegetables.\n      \n      Bring to a boil over medium-high heat. Reduce heat to low, cover pot, and simmer until all vegetables are tender, about 40 minutes.\n      \n      Transfer soup to a blender and process until smooth. Return to the pot and mix in any remaining stock to reach desired consistency. Season with salt and pepper.\n      \n      Serve hot and enjoy!"
  },
  {
    "id": "clngbjaxg0001mxhdf5ledb61",
    "name": "Cheddar Bay Biscuit Chicken Cobbler",
    "image": "https://www.allrecipes.com/thmb/LpwZPAeCKOezSkm5Ec-0nBgGpm8=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Cheddar-Bay-Biscuit-Chicken-Cobbler-ddmfs-3x4-1-f90dd44c4c98447a8121268179e5909b.jpg",
    "description": "This chicken cobbler takes the flavors of chicken pot pie but instead of encasing it in pie crust it's topped with Red Lobster's Cheddar Bay Biscuits.",
    "servings": 8,
    "prepTime": 15,
    "cookTime": 40,
    "ingredients": "2 tablespoons unsalted butter, melted\n\n4 cups shredded rotisserie chicken\n\n1 (15 ounce) package frozen mixed vegetables\n\n1 teaspoon chopped fresh thyme, plus more for garnish\n\n3/4 teaspoon freshly ground black pepper\n\n1/4 teaspoon kosher salt, or to taste\n\n1 (10.5oz) can condensed cream of chicken soup\n\n1 ½ cups chicken broth\n\n½ cup heavy whipping cream\n\n1 package cheddar biscuit mix (such as Red Lobster Cheddar Bay Biscuit Mix)",
    "directions": "Preheat the oven to 350 degrees F (175 degrees C). Coat the bottom of a 13x9-inch baking dish with melted butter.\n\nPlace shredded chicken and vegetables into the dish; season with thyme, pepper, and salt. Pour over condensed soup, broth, and cream; stir until well combined.\n\nPrepare biscuit mix according to package instructions.\n\nDrop 8 (about 1/4 cup) biscuit dough portions onto chicken and vegetable mixture.\n\nBake in the preheated oven, uncovered, until biscuits are golden brown on top and casserole is bubbling around the edges, about 40 minutes. Sprinkle with thyme."
  },
  {
    "id": "clngbjaxg0001mxhdf5ledb62",
    "name": "Basic Mashed Potatoes",
    "image": "https://www.allrecipes.com/thmb/JMkfc1WFQiiKmTzvz98IXhlOMsg=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/24771-basic-mashed-potatoes-mfs321-158e1626bfeb48daadb4f25d737ffee91-912ba4ee2c3c40a1837a5690971cc554.jpg",
    "description": "This mashed potato recipe is perfect if you're looking for good, old-fashioned mashed potatoes. Made with Idaho potatoes, milk, butter, and optional garlic, this go-to recipe makes a classic holiday dish. Learn how to make mashed potatoes that come out smooth, creamy, and delicious every time. Serve with gravy or extra butter on top.",
    "servings": 4,
    "prepTime": 15,
    "cookTime": 20,
    "ingredients": "2 pounds baking potatoes, peeled and quartered\n\n3 cloves garlic, peeled, or to taste (Optional)\n\n1 cup milk\n\n2 tablespoons butter\n\nsalt and ground black pepper to taste",
    "directions": "Bring a large pot of salted water to a boil. Add potatoes and garlic, lower heat to medium, and simmer until potatoes are tender, 15 to 20 minutes.\n\nWhen the potatoes are almost finished, heat milk and butter in a small saucepan over low heat until butter is melted.\n\nDrain potatoes and return to the pot. Slowly add warm milk mixture, blending it in with a potato masher or electric mixer until potatoes are smooth and creamy. Season with salt and pepper."
  },
  {
    "id": "clngbjaxg0001mxhdf5ledb63",
    "name": "Homemade Mac and Cheese",
    "image": "https://www.allrecipes.com/thmb/l_4jvrIlQFNFZjDofxZ2InsrRE4=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/11679-homemade-mac-and-cheese-chef-mo-3x2-1-00572eb7b88e43cfa3e9fa4b92cc9c23.jpg",
    "description": "This mac and cheese recipe with a buttered bread crumb topping is creamy and comforting. It's easy to make the cheese sauce from scratch on your stovetop, starting with a roux and adding milk, Cheddar, and Parmesan, resulting in a rich, decadent sauce that coats every nook and cranny of the noodles.",
    "servings": 4,
    "prepTime": 10,
    "cookTime": 45,
    "ingredients": "8 ounces uncooked elbow macaroni\n\n¼ cup salted butter\n\n3 tablespoons all-purpose flour\n\n2 ½ cups milk, or more as needed\n\n2 cups shredded sharp Cheddar cheese\n\n½ cup finely grated Parmesan cheese\n\nsalt and ground black pepper to taste (Optional)\n\n2 tablespoons salted butter\n\n½ cup dry bread crumbs\n\n1 pinch ground paprika",
    "directions": "Preheat the oven to 350 degrees F (175 degrees C). Grease an 8-inch square baking dish.\n\nMake the macaroni and cheese: Bring a large pot of lightly salted water to a boil. Add macaroni and simmer, stirring occasionally, until tender yet firm to the bite, about 8 minutes; it will finish cooking in the oven. Drain and transfer to the prepared baking dish.\n\nWhile the macaroni is cooking, melt 1/4 cup butter in a medium skillet over low heat. Whisk in flour and stir until the mixture becomes paste-like and light golden brown, 3 to 5 minutes.\n\nGradually whisk 2 1/2 cups milk into the flour mixture, and bring to a simmer. Stir in shredded Cheddar and finely grated Parmesan cheeses; season with salt and pepper. Cook and stir over low heat until cheese is melted and sauce has thickened, 3 to 5 minutes, adding up to 1/2 cup more milk if needed. Pour cheese sauce over macaroni and stir until well combined.\n\nMake the bread crumb topping: Melt 2 tablespoons butter in a skillet over medium heat. Add bread crumbs; cook and stir until well coated and browned. Spread bread crumbs over macaroni and cheese, then sprinkle with paprika.\n\nBake in the preheated oven until topping is golden brown and macaroni and cheese is bubbling, about 30 minutes."
  },
  {
    "id": "clngbjaxg0001mxhdf5ledb64",
    "name": "Good New Orleans Creole Gumbo",
    "image": "https://www.allrecipes.com/thmb/JNMEfzlnDhNCPPUmKqdiqDktCCM=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/216888-good-new-orleans-creole-gumbo-DDMFS-4x3-573c0eb9f4584d92a0bd2b4e4065022a.jpg",
    "description": "I am going to give you my Creole gumbo recipe. I learned to cook from my mother and grandmother who were born and raised in New Orleans and really knew how to cook. Most of the time, you could not get them to write down their recipes because they used a 'pinch' of this and 'just enough of that' and 'two fingers of water,' and so on. This recipe is a combination of both of their recipes which I have added to over the years. Serve over hot cooked rice. The gumbo can be frozen or refrigerated and many people like it better the next day. Bon appetit!",
    "servings": 4,
    "prepTime": 60,
    "cookTime": 160,
    "ingredients": "1 cup all-purpose flour\n\n¾ cup bacon drippings\n\n1 cup coarsely chopped celery\n\n1 large onion, coarsely chopped\n\n1 large green bell pepper, coarsely chopped\n\n2 cloves garlic, minced\n\n1 pound andouille sausage, sliced\n\n3 quarts water\n\n6 cubes beef bouillon\n\n1 tablespoon white sugar\n\nsalt to taste\n\n2 tablespoons hot pepper sauce (such as Tabasco®), or to taste\n\n½ teaspoon Cajun seasoning blend (such as Tony Chachere's®), or to taste\n\n4 bay leaves\n\n½ teaspoon dried thyme leaves\n\n1 (14.5 ounce) can stewed tomatoes\n\n1 (6 ounce) can tomato sauce\n\n4 teaspoons file powder, divided\n\n2 tablespoons bacon drippings\n\n2 (10 ounce) packages frozen cut okra, thawed\n\n2 tablespoons distilled white vinegar\n\n1 pound lump crabmeat\n\n3 pounds uncooked medium shrimp, peeled and deveined\n\n2 tablespoons Worcestershire sauce",
    "directions": "Gather all ingredients.\n\nAll ingredients gathered to make New Orleans Creole gumbo.\n\nMake the roux: Whisk together flour and 3/4 cup bacon drippings in a large, heavy saucepan over medium-low heat until smooth. Cook roux, whisking constantly, until it turns a rich mahogany brown color. This can take 20 to 30 minutes; watch heat carefully and whisk constantly or roux will burn. Remove from heat; continue whisking until mixture stops cooking.\n\nRoux being mixed until it turns a rich mahogany color.\n\nMake the gumbo: Place celery, onion, green bell pepper, and garlic into the work bowl of a food processor, and pulse until all vegetables are very finely chopped.\n\nStir vegetables into the roux, and mix in sausage. Bring mixture to a simmer over medium-low heat, and cook until vegetables are tender, 10 to 15 minutes. Remove from heat and set aside.\n\nVegetables stirred into the roux and sausage mixed in, cooking until tender.\n\nCombine water and beef bouillon cubes in a large Dutch oven or soup pot and bring to a boil over medium-high heat. Stir until bouillon cubes dissolve, then whisk roux mixture into the boiling water.\n\nReduce heat to a simmer and mix in sugar, salt, hot pepper sauce, Cajun seasoning, bay leaves, thyme, stewed tomatoes, and tomato sauce. Simmer soup over low heat for 1 hour; mix in 2 teaspoons of file gumbo powder at the 45-minute mark.\n\nMeanwhile, melt 2 tablespoons bacon drippings in a skillet over medium heat. Add okra and vinegar and cook for 15 minutes; remove okra with a slotted spoon, and stir into the simmering gumbo.\n\nMix in crabmeat, shrimp, and Worcestershire sauce, and simmer until flavors have blended, 45 more minutes. Stir in 2 more teaspoons of file gumbo powder just before serving.\n\nAll ingredients mixed together and simmering until all flavors have blended.\n\nServe hot and enjoy!"
  },
  {
    "id": "clngbjaxg0001mxhdf5ledb65",
    "name": "Perfect Pancakes",
    "image": "https://www.allrecipes.com/thmb/DZ5WtIe2s6rGk-rIEZDkMA6mGj4=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/7568285-perfect-pancakes-KH-4x3-218e2c39174c4a2293fca0ab752b38a8.jpg",
    "description": "Serve these pancakes with butter and syrup, or up the ante with toppings such as sprinkles, chopped bittersweet chocolate, and sliced or chopped fruit for a perfect breakfast.",
    "servings": 6,
    "prepTime": 5,
    "cookTime": 20,
    "ingredients": "2 cups whole milk\n\n1/4 cup white vinegar\n\n2 1/2 cups flour\n\n3/4 cup sugar\n\n2 teaspoons baking powder\n\n1 teaspoon baking soda\n\n1 teaspoon salt\n\n3 large eggs\n\n1 teaspoon vanilla extract\n\n1 tablespoon butter, softened, or as needed, for greasing, plus more for serving\n\ntoppings of choice, e.g. maple syrup or fruit, for serving",
    "directions": "Preheat a griddle to 300 degrees F (175 degrees C).\n\nStir together milk and vinegar in a small bowl or a 4-cup liquid measuring cup.\n\nWhisk together flour, sugar, baking powder, baking soda, and salt in a second bowl.\n\nBeat eggs in a large bowl until smooth. Add vanilla and milk mixture; whisk together. Add flour mixture to bowl with egg mixture and whisk until just combined. (Batter will be lumpy.) Let rest 3 minutes and gently stir again.\nMelt some butter on the griddle, then carefully wipe with a paper towel. (You want just a bit of a sheen; don’t overgrease the griddle.) Spoon batter in 1/3-cup portions onto griddle. Cook until bubbles form on surface of batter, about 2 1/2 minutes.\n\nFlip pancakes and cook until browned on the other side, about 1 1/2 minutes more. Repeat with remaining batter. Serve immediately with butter and toppings."
  },
  {
    "id": "clngbjaxg0001mxhdf5ledb66",
    "name": "Strawberry Rhubarb Drop Biscuits",
    "image": "https://www.allrecipes.com/thmb/ZNfwRNqh7_O5guNsJ3wpZPVUTIQ=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/7495124StrawberryRhubarbDropBiscuitsChefJohn4x3-f3087420a006412697398995753fdefb.jpg",
    "description": "These strawberry rhubarb drop biscuits are sweet with a scone-like texture — perfect for brunch. The technique is quick and easy and results in tender, moist, and delightfully fruity biscuits.",
    "servings": 10,
    "prepTime": 20,
    "cookTime": 25,
    "ingredients": "1 1/4 cups cubed rhubarb\n\n1 1/4 cups cubed strawberries\n\n2 tablespoons white sugar\n\n2 cups all-purpose flour\n\n2 1/2 teaspoons baking powder\n\n1/2 teaspoon baking soda\n\n1/2 teaspoon fine salt\n\n1/2 cup (1 stick) frozen unsalted butter\n\n1/4 cup white sugar\n\n2 tablespoons reserved fruit syrup\n\n3/4 cup cold buttermilk\n\n1 large egg (optional)\n\n2 teaspoons water (optional)\n\n1/3 cup packed powdered sugar\n\n1 teaspoon finely grated lemon zest\n\n2 teaspoons lemon juice, plus more as needed",
    "directions": "Cut ribs of rhubarb in half lengthwise and slice into 1/4-inch pieces; place into a bowl. Add cubed strawberries and 2 tablespoons sugar. Toss to combine, cover, and let fruit macerate in the refrigerator for 1 to 2 hours.\n\nCombine flour, baking powder, baking soda, and salt in a mixing bowl; whisk to combine.\n\nDrain fruit in a strainer set over a bowl. Reserve the syrupy juices that pass through.\n\nGrate frozen butter into the flour mixture, while stirring with a fork several times to coat butter pieces with flour. Add 1/4 cup sugar, and drained fruit, mixing with a fork until fruit is coated with flour.\n\nAdd 2 tablespoons of the reserved fruit juices, and pour in buttermilk. Mix with a fork just until the dry ingredients are incorporated into the dough. If the mixture is too dry to come together, add a little more buttermilk. If it seems too wet, and sticky, add a little more flour.\n\nPreheat the oven to 450 degrees F (230 degrees C). Line a baking sheet with a silpat mat.\n\nScoop or spoon equal portions of dough onto the prepared baking sheet. Whisk together egg and water in a small bowl. Brush biscuits with egg wash, and sprinkle with sugar.\n\nBake in the preheated oven for about 25 minutes. Transfer to a wire rack and let cool completely.\n\nMix powdered sugar, lemon zest, and lemon juice together in a small bowl for the lemon icing. Fill icing into a piping bag or a plastic bag with the tip cut off and drizzle icing over cooled biscuits."
  },
  {
    "id": "clngbjaxg0001mxhdf5ledb67",
    "name": "Croissant French Toast",
    "image": "https://www.allrecipes.com/thmb/3qw9ZEX9v48J9Rmt__QGmtqoyxo=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/8495603-Croissant-french-toast-4x3-1-2000-55e876dcd00e4c7baeba216c063566e0.jpg",
    "description": "An easy and impressive breakfast or brunch, this recipe is the perfect choice for special occasions or holidays. Serve warm with your favorite toppings. Some suggestions are powdered sugar, chopped nuts, cinnamon sugar, berries, maple syrup, blueberry or strawberry syrup, and whipped cream.",
    "servings": 4,
    "prepTime": 10,
    "cookTime": 15,
    "ingredients": "4 large croissants, halved horizontally, left out overnight\n\n3 large eggs\n\n½ cup half-and-half\n\n1 tablespoon white sugar\n\n2 teaspoons vanilla extract\n\n½ teaspoon ground cinnamon\n\n¼ teaspoon salt\n\n1 pinch ground nutmeg\n\n2 tablespoons unsalted butter",
    "directions": "Preheat the oven to 200 degrees F (95 degrees C).\n\nWhisk eggs, half-and-half, sugar, vanilla, cinnamon, salt, and nutmeg together in a shallow bowl. Dip each croissant half into the egg mixture, one at a time, flipping it and lightly pressing down, until well coated.\n\nMelt the butter in a large skillet over medium heat; add four croissant halves, cut side down. Fry until browned on both sides, turning once, 2 to 3 minutes per side. Transfer to the oven to keep warm while you cook the remaining croissants.\n\nServe warm with your favorite toppings."
  },
  {
    "id": "clngbjaxg0001mxhdf5ledb68",
    "name": "Banana Zucchini Bread",
    "image": "https://www.allrecipes.com/thmb/zaFf3GxF3JQnXSvm2ss02Y2gyKs=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/3894402-e8a0eab7a0e4418fada2c27859ee6f4f.jpg",
    "description": "This banana zucchini bread combines two of my favorites: banana walnut bread and zucchini bread. I like to add dried cranberries for an extra boost of flavor in every bite.",
    "servings": 20,
    "prepTime": 15,
    "cookTime": 45,
    "ingredients": "3 large eggs\n\n1 cup white sugar\n\n1 cup grated zucchini\n\n¾ cup vegetable oil\n\n2 bananas, mashed\n\n⅔ cup packed brown sugar\n\n2 teaspoons vanilla extract\n\n3 ½ cups all-purpose flour\n\n1 tablespoon ground cinnamon\n\n1 ½ teaspoons baking powder\n\n1 teaspoon baking soda\n\n1 teaspoon salt\n\n½ cup dried cranberries\n\n½ cup chopped walnuts",
    "directions": "Preheat the oven to 325 degrees F (165 degrees C). Grease and flour two 8x4-inch bread loaf pans.\n\nBeat eggs in a large bowl with an electric mixer until light yellow and frothy. Add white sugar, zucchini, oil, bananas, brown sugar, and vanilla; beat until well combined. Stir in flour, cinnamon, baking powder, baking soda, and salt. Fold in cranberries and nuts. Divide batter evenly between the prepared loaf pans.\n\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 45 to 50 minutes. Allow to cool in the loaf pans on a wire rack before removing and serving."
  },
  {
    "id": "clngbjaxg0001mxhdf5ledb69",
    "name": "Old-Fashioned Potato Salad",
    "image": "https://www.allrecipes.com/thmb/tuKD_jawKu1hfM6GLSU7NLIZ9CA=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/16729-old-fashioned-potato-salad-DDMFS-4x3-3e270b1b82744aa6ac355fef41a5a43c.jpg",
    "description": "This potato salad recipe is for the traditional creamy type of potato salad, with eggs, celery, and relish. It's perfect for making ahead to let the flavors develop.",
    "servings": 8,
    "prepTime": 15,
    "cookTime": 15,
    "ingredients": "5 potatoes\n\n3 eggs\n\n1 cup chopped celery\n\n½ cup chopped onion\n\n½ cup sweet pickle relish\n\n¼ cup mayonnaise\n\n1 tablespoon prepared mustard\n\n¼ teaspoon garlic salt\n\n¼ teaspoon celery salt\n\nground black pepper to taste",
    "directions": "Gather all ingredients.\n\nOverhead view looking at all ingredients for old fashioned potato salad.\n\nBring a large pot of salted water to a boil. Add potatoes and cook until tender but still firm, about 15 minutes.\n\nDrain, cool, peel, and chop potatoes.\n\nOverhead view of cooked potatoes, peeled and chopped.\n\nWhile potatoes cook, place eggs in a saucepan and cover with cold water. Bring water to a boil; cover, remove from heat, and let eggs stand in hot water for 10 to 12 minutes.\n\nRemove from hot water, cool, peel, and chop eggs.\n\nOverhead view of hard-boiled eggs peeled and chopped.\n\nCombine the potatoes, eggs, celery, onion, relish, mayonnaise, mustard, garlic salt, celery salt, and pepper in a large bowl. Mix together well and refrigerate until chilled.\n\nOverhead view of potato salad ingredients mixed together.\n\nEnjoy!"
  },
  {
    "id": "clngbjaxg0001mxhdf5ledb70",
    "name": "Fresh Tomato Soup",
    "image": "https://www.allrecipes.com/thmb/odV3ZiB5H-hWCLi2SV4lNdtJLhs=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/39544-Garden-Fresh-Tomato-Soup-DDMFS-4x3-b8e94cf7ab8e42f4b79042fc0df55546.jpg",
    "description": "This tomato soup recipe is simple, quick, and perfect to make when tomatoes are ripe in gardens and farmers' markets for a delicious summertime treat.",
    "servings": 6,
    "prepTime": 5,
    "cookTime": 30,
    "ingredients": "4 cups chopped fresh tomatoes\n\n2 cups chicken broth\n\n4 cloves garlic\n\n1 large slice of onion\n\n2 tablespoons butter\n\n2 tablespoons all-purpose flour\n\n2 teaspoons white sugar, or to taste\n\n1 teaspoon salt, or to taste",
    "directions": "Gather all ingredients.\n\nAll ingredients gathered to make fresh tomato soup.\n\nCombine tomatoes, chicken broth, garlic cloves, and a large slice of onion in a stockpot over medium heat. Bring to a boil, and gently simmer for about 20 minutes to blend flavors.\n\nCombine tomatoes, onion, garlic cloves and chicken broth in a stockpot.\n\nBring to a boil to blend all the flavors. \n\nRemove from heat and run the mixture through a food mill into a large bowl, or pan. Discard any stuff left over in the food mill.\n\nRun the mixture through a food mill. \n\nMelt butter over medium heat in the now empty stockpot. Stir in flour to make a roux by cooking, whisking constantly, until mixture turns medium brown.\n\nMelt butter over medium heat and stir in flour to make a medium brown roux.\n\nGradually whisk in a bit of the tomato mixture to prevent lumps from forming, then stir in the rest.\n\nGradually whisk in tomato mixture. \n\nSeason with sugar and salt to taste.\n\nSeason with salt and sugar. \n\nServe hot and enjoy!"
  },
  {
    "id": "clngbjaxg0001mxhdf5ledb71",
    "name": "Beet Salad with Goat Cheese",
    "image": "https://www.allrecipes.com/thmb/A4TWt-zZBUVovmVTptHSLSvDo1Y=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/90500-beet-salad-with-goat-cheese-ddmfs-beauty-3x4-a41ec21c51e94b479362ce1e25c5eb44.jpg",
    "description": "This delicious beet salad with creamy goat cheese, maple-candied walnuts, and a tangy orange and balsamic vinaigrette is a beautiful way to serve beets.",
    "servings": 6,
    "prepTime": 10,
    "cookTime": 30,
    "ingredients": "4 medium beets - scrubbed, trimmed, and cut in half\n\n1/3 cup chopped walnuts\n\n3 tablespoons maple syrup\n\n1 (10 ounce) package mixed baby salad greens\n\n1/2 cup frozen orange juice concentrate\n\n1/4 cup balsamic vinegar\n\n1/2 cup extra-virgin olive oil\n\n2 ounces goat cheese",
    "directions": "Place beets into a saucepan; add enough water to cover. Bring to a boil, then cook for 20 to 30 minutes, until tender. Drain and cool, then cut into cubes.\n\nBeets drained and cut into cubes.\n\nWhile beets are cooking, place walnuts in a skillet over medium-low heat. Heat until warm and starting to toast. Stir in maple syrup; cook and stir until evenly coated, then remove from heat and set aside to cool.\n\nBrowned walnuts in a skillet, coated with maple syrup.\n\nTo make the dressing: Whisk orange juice concentrate, balsamic vinegar, and olive oil together in a small bowl.\n\nOrange juice concentrate, balsamic vinegar and olive oil whisked together to make the dressing.\n\nPlace a large helping of baby greens onto each of four salad plates, divide candied walnuts equally and sprinkle over greens. Place equal amounts of beets over greens and top with pieces of goat cheese. Drizzle dressing over each salad."
  },
  {
    "id": "clngbjaxg0001mxhdf5ledb72",
    "name": "Caprese Salad with Balsamic Reduction",
    "image": "https://www.allrecipes.com/thmb/eE8Y1xRVY9nxwZ7UwRWp53WNrsw=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/1018869-400586536fcc4e77a22223465b65e095.jpg",
    "description": "This caprese salad with tomatoes, fresh mozzarella, and basil is drizzled with a sweet balsamic reduction and olive oil. Easy, impressive, and delicious!",
    "servings": 4,
    "prepTime": 15,
    "cookTime": 10,
    "ingredients": "1 cup balsamic vinegar\n\n¼ cup honey\n\n3 large tomatoes, cut into 1/2-inch slices\n\n1 (16 ounce) package fresh mozzarella cheese, cut into 1/4-inch slices\n\n¼ teaspoon salt\n\n¼ teaspoon ground black pepper\n\n½ cup fresh basil leaves\n\n¼ cup extra-virgin olive oil",
    "directions": "Stir balsamic vinegar and honey together in a small saucepan and place over high heat. Bring to a boil, reduce heat to low, and simmer until mixture has reduced to 1/3 cup, about 10 minutes. Set aside to cool.\n\nArrange alternating slices of tomato and mozzarella decoratively on a serving platter. Sprinkle with salt and black pepper, tuck basil leaves around slices, and drizzle with olive oil and the balsamic reduction."
  },
  {
    "id": "clngbjaxg0001mxhdf5ledb73",
    "name": "Oven-Baked Salmon",
    "image": "https://hips.hearstapps.com/hmg-prod/images/baked-salmon-lead-650b19177aedc.jpg?crop=1xw:1xh;center,top&resize=1200:*",
    "description": "Whether you're looking for the easiest way to feed a crowd or a simple, hands-off weeknight dinner, this is a recipe you'll want to keep up your sleeve.",
    "servings": 4,
    "prepTime": 10,
    "cookTime": 25,
    "ingredients": "2 lemons, thinly sliced\n1 large skin-on salmon fillet (about 3 lb.)\nKosher salt\nFreshly ground black pepper\n2 cloves garlic, finely chopped\n6 tbsp. unsalted butter, melted\n2 tbsp. honey\n1 tsp. chopped fresh thyme leaves\n1 tsp. dried oregano\nChopped fresh parsley, for serving",
    "directions": "Preheat oven to 350°. Line a large rimmed baking sheet with foil, then line foil with parchment (so the lemon slices don’t interact with the foil). In center of parchment, arrange lemon slices in an even layer.\n\nSeason salmon with salt and pepper and place on top of lemon slices.\n\nIn a small bowl, whisk garlic, butter, honey, thyme, and oregano until combined. Pour over salmon, then fold up parchment and foil around salmon.\n\nBake salmon until opaque, cooked through, and flesh easily flakes with a fork, about 25 minutes.\n\nHeat broiler. Broil salmon, watching closely, until browned in spots, 4 to 6 minutes.\n\nTop with parsley before serving."
  },
  {
    "id": "clngbjaxg0001mxhdf5ledb74",
    "name": "Zesty Quinoa Salad",
    "image": "https://www.allrecipes.com/thmb/oHEw00QPYOyOyKQ8BR--Qj6vlog=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/229156-Zesty-Quinoa-Salad-ddmps-4x3-104421-df647e343ce543769a038cccf4c6419c.jpg",
    "description": "This quinoa salad is a great summertime recipe (or anytime you want to feel like it's summertime). Light and citrusy, it's a whole new way to enjoy quinoa. Lime juice and cilantro give a refreshing kick, while quinoa and black beans provide tasty vegan protein. If you're not vegan, add even more protein by adding chunks of chicken or turkey. This salad tastes great right away and even better the next day when all the flavors have had the chance to marry.",
    "servings": 6,
    "prepTime": 20,
    "cookTime": 15,
    "ingredients": "2 cups water\n\n1 cup quinoa\n\n¼ cup extra-virgin olive oil\n\n2 limes, juiced\n\n2 teaspoons ground cumin\n\n1 teaspoon salt\n\n½ teaspoon red pepper flakes, or more to taste\n\n1 ½ cups halved cherry tomatoes\n\n1 (15 ounce) can black beans, drained and rinsed\n\n5 green onions, finely chopped\n\n¼ cup chopped fresh cilantro\n\nsalt and ground black pepper to taste",
    "directions": "Bring water and quinoa to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until quinoa is tender and water has been absorbed, 10 to 15 minutes. Set aside to cool.\n\nMeanwhile, whisk olive oil, lime juice, cumin, salt, and red pepper flakes together in a small bowl.\n\nCombine quinoa, tomatoes, black beans, and green onions in a large bowl. Pour dressing over quinoa mixture; toss to coat. Stir in cilantro; season with salt and black pepper.\n\nServe immediately or chill in the refrigerator."
  },
  {
    "id": "clngbjaxg0001mxhdf5ledb75",
    "name": "Avocado Breakfast Sandwich",
    "image": "https://www.allrecipes.com/thmb/lmcm7Qh7Bjvo_myQQ_8jAimFOeA=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/4520479-avocado-breakfast-sandwich-Buckwheat-Queen-1x1-1-0c41845d9017421a86e742a0d19302d2.jpg",
    "description": "Make this egg and avocado sandwich for a delicious restaurant-style breakfast at home! It's quick, easy, and delicious. The sliced avocado is what makes this sandwich pop and gives it a unique flavor. It is chock-full of protein, as well, so this sandwich will keep you full until lunchtime.",
    "servings": 1,
    "prepTime": 10,
    "cookTime": 6,
    "ingredients": "1 tablespoon olive oil\n\n2 large eggs\n\nsalt and ground black pepper to taste\n\n1 tablespoon butter, softened\n\n2 slices Italian bread\n\n1 ounce Swiss cheese, sliced\n\n1 ounce Cheddar cheese, sliced\n\n½ ripe avocado, sliced",
    "directions": "Heat olive oil in a skillet over medium heat. Crack eggs into skillet; cook for 1 to 2 minutes. Flip and cook egg until done, 2 to 5 minutes more. Transfer eggs to a plate and season with salt and pepper.\n\nSpread butter onto 1 side of each bread slice.\n\nHeat a skillet over medium heat. Lay bread slices in the hot skillet, butter-side down. Quickly layer Swiss cheese, 1 fried egg, Cheddar cheese, 1 fried egg, avocado, and remaining bread slice, butter-side up. Carefully flip sandwich to grill other side until golden brown, 3 to 4 minutes.\n\nRemove sandwich from skillet and cut in half."
  },
  {
    "id": "clngbjaxg0001mxhdf5ledb76",
    "name": "Bibimbap (Korean Rice With Mixed Vegetables)",
    "image": "https://www.allrecipes.com/thmb/5Zx-fq1l7hiwQDPBLArguNmsahk=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/228240-BibimbapKoreanRiceWithMixedVegtables-ddmfs-4X3-0667-6033d57010ea4dd3bd7b95fb36d3dd51.jpg",
    "description": "This bibimbap recipe makes a popular and delicious Korean meal. Meaning mixed rice, bibimbap is a delicious rice bowl topped with vegetables, beef, a whole egg, and gochujang (red chili pepper paste). Traditionally, bibimbap was eaten on the eve of the Lunar New Year, to use up any leftovers before the start of the new year.",
    "servings": 4,
    "prepTime": 30,
    "cookTime": 30,
    "ingredients": "1 English cucumber, cut into matchsticks\n\n¼ cup gochujang (Korean hot pepper paste) (Optional)\n\n1 bunch fresh spinach, cut into thin strips\n\n1 tablespoon soy sauce\n\n2 teaspoons olive oil, divided\n\n2 carrots, cut into matchsticks \n\n1 clove garlic, minced\n\n1 pinch red pepper flakes\n\n1 pound thinly-sliced beef top round steak\n\n4 large eggs\n\n4 cups cooked white rice\n\n4 teaspoons toasted sesame oil, divided\n\n1 teaspoon sesame seeds\n\n2 teaspoons gochujang (Korean hot pepper paste), divided (Optional)",
    "directions": "Stir together cucumber pieces and gochujang paste in a bowl; set aside.\n\nBring about 2 cups water to a boil in a large nonstick skillet and stir in spinach; cook until bright green and wilted, 2 to 3 minutes.\n\nDrain spinach and squeeze out as much moisture as possible; set spinach aside in a bowl and stir in soy sauce.\n\nHeat 1 teaspoon olive oil in a large nonstick skillet; cook and stir carrots until softened, about 3 minutes.\n\nStir in garlic and cook just until fragrant, about 1 minute. Stir in cucumber mixture; sprinkle with red pepper flakes. Set carrot mixture aside in a bowl.\n\nBrown beef in a clean nonstick skillet over medium heat, about 5 minutes per side; set aside.\n\nHeat remaining 1 teaspoon olive oil in another nonstick skillet over medium-low heat. Fry eggs just on one side until yolks are runny, but whites are firm, 2 to 4 minutes.\n\nDivide cooked rice into 4 large serving bowls; top with spinach mixture, a few pieces of beef, and cucumber mixture. Place 1 egg atop each serving. Drizzle each bowl with 1 teaspoon sesame oil, a sprinkle of sesame seeds, and a small amount of gochujang paste if desired."
  },
  {
    "id": "clngbjaxg0001mxhdf5ledb77",
    "name": "Shrimp Marinara",
    "image": "https://www.allrecipes.com/thmb/rlodttra6H7V89oghj4cP02ufxQ=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/7972426-shrimp-marinara-ddmfs-4x3-608ceee07d004406b17237b5d8cbf231.jpg",
    "description": "Shrimp marinara hits all the right spots - tasty shrimp with homemade tomato sauce served over spaghetti. A quick and easy weeknight meal.",
    "servings": 4,
    "prepTime": 10,
    "cookTime": 15,
    "ingredients": "12 ounces dry spaghetti\n\n3 tablespoons extra virgin olive oil\n\n1 pound large shrimp, peeled and deveined\n\n4 cloves garlic, sliced\n\n1/2 teaspoon crushed red pepper\n\n1 (15-ounce) diced fire-roasted tomatoes\n\n1 (15 ounce) can tomato sauce\n\n1/4 cup chopped fresh basil, plus more for garnish\n\n1 tablespoon balsamic vinegar\n\n1 teaspoon dried oregano\n\n1/4 teaspoon kosher salt",
    "directions": "Gather all ingredients.\n\nPrepare spaghetti according to package directions; drain and keep warm.\n\nMeanwhile, heat oil over medium heat in a large skillet. Add shrimp and cook 2 to 3 minutes or until nearly opaque, turning once.\n\nTransfer shrimp to a plate. Add garlic and crushed red pepper to the skillet. Cook and stir until fragrant, about 1 minute.\n\nStir in undrained tomatoes, tomato sauce, basil, balsamic vinegar, oregano, and salt. Bring to a boil. Reduce heat and simmer, uncovered, until thickened, 10 minutes.\n\nReturn shrimp to skillet and simmer to heat through, about 1 minute. Serve over spaghetti, topped with additional fresh basil."
  }
]
